<?php
$oneday_weather = 	'{"weatherinfo":
{"city":"上海","cityid":"101020100","temp1":"34℃","temp2":"24℃","weather":"多云",
		"img1":"d1.gif","img2":"n1.gif","ptime":"11:00"}}';
$threedays_weather = 	'{"weatherinfo":
{"city":"上海","cityid":"101020100","temp":"28","WD":"西南风",
		"WS":"1级","SD":"67%","WSE":"1","time":"11:00","isRadar":"1","Radar":"JC_RADAR_AZ9210_JB"}}';
$sevendays_weather = 	'{"weatherinfo":
{"city":"上海","city_en":"shanghai","date_y":"2012年6月8日",
		"date":"","week":"星期五","fchh":"11","cityid":"101020100",
		"temp1":"34℃~24℃","temp2":"33℃~24℃","temp3":"31℃~23℃",
		"temp4":"28℃~22℃","temp5":"30℃~21℃","temp6":"31℃~21℃",
		"tempF1":"93.2℉~75.2℉","tempF2":"91.4℉~75.2℉",
		"tempF3":"87.8℉~73.4℉","tempF4":"82.4℉~71.6℉",
		"tempF5":"86℉~69.8℉","tempF6":"87.8℉~69.8℉",
		"weather1":"多云","weather2":"多云转阴","weather3":"阵雨","weather4":"雷阵雨转小雨",
		"weather5":"多云","weather6":"阴转多云","img1":"1",
		"img2":"99","img3":"1","img4":"2","img5":"3","img6":"99","img7":"4","img8":"7","img9":"1","img10":"99","img11":"2","img12":"1",
		"img_single":"1","img_title1":"多云","img_title2":"多云","img_title3":"多云","img_title4":"阴","img_title5":"阵雨","img_title6":"阵雨","img_title7":"雷阵雨","img_title8":"小雨","img_title9":"多云","img_title10":"多云","img_title11":"阴","img_title12":"多云","img_title_single":"多云",
		"wind1":"西风小于3级","wind2":"西南风转南风小于3级","wind3":"东南风转东风小于3级","wind4":"东风小于3级","wind5":"北风小于3级","wind6":"南风小于3级","fx1":"西风","fx2":"西风","fl1":"小于3级","fl2":"小于3级","fl3":"小于3级","fl4":"小于3级","fl5":"小于3级","fl6":"小于3级",
		"index":"炎热","index_d":"天气炎热，建议着短衫、短裙、短裤、薄型T恤衫、敞领短袖棉衫等清凉夏季服装。",
		"index48":"炎热","index48_d":"天气炎热，建议着短衫、短裙、短裤、薄型T恤衫、敞领短袖棉衫等清凉夏季服装。",
		"index_uv":"中等","index48_uv":"弱","index_xc":"较适宜","index_tr":"较适宜","index_co":"很不舒适","st1":"34","st2":"25","st3":"33","st4":"24","st5":"29","st6":"21","index_cl":"较适宜","index_ls":"适宜","index_ag":"不易发"}}';
		$zs = 	'{"zs":{"date":"201206080815","ac_name":"空调开启指数","ac_hint":"部分时间开启","ac_des":"天气热，到中午的时候您将会感到有点热，因此建议在午后较热时开启制冷空调。","ag_name":"息斯敏过敏指数",
		"ag_hint":"不易发","ag_des":"天气条件不易诱发过敏，可放心外出，除特殊体质外，无需担心过敏问题。","cl_name":"晨练指数","cl_hint":"较适宜","cl_des":"早晨气象条件较适宜晨练，但天气阴沉，晨练时会感觉有点凉，晨练时着装不要过于单薄，并避免在林中晨练。","co_name":"舒适度指数","co_hint":"较不舒适","co_des":"天气较热，会使您感到不很舒适。","ct_name":"穿衣指数",
		"ct_hint":"炎热","ct_des":"天气炎热，建议着短衫、短裙、短裤、薄型T恤衫、敞领短袖棉衫等清凉夏季服装。","dy_name":"钓鱼指数","dy_hint":"不宜","dy_des":"天气太热，不适合垂钓。","fs_name":"防晒指数","fs_hint":"较弱","fs_des":"紫外线强度较弱，建议涂擦SPF在12-15之间，PA+的防晒护肤品。","gj_name":"逛街指数","gj_hint":"较适宜","gj_des":"天气较好，虽然天气较热，还是较适宜逛街的，穿上透气的衣服就可放心出门了。","gm_name":"感冒指数","gm_hint":"少发","gm_des":"各项气象条件适宜，发生感冒机率较低。但请避免长期处于空调房间中，以防感冒。",
		"gz_name":"干燥指数","gz_hint":"适宜","gz_des":"温湿条件适宜，风速不大，皮肤无需特殊保养，只做日常护理即可。","hc_name":"划船指数","hc_hint":"较适宜","hc_des":"白天较适宜划船，但阴沉的天气可能会影响您的心情。","jt_name":"交通指数","jt_hint":"良好","jt_des":"阴天，路面干燥，交通气象条件良好，车辆可以正常行驶。","lk_name":"路况指数","lk_hint":"干燥","lk_des":"阴天，路面比较干燥，路况较好。","ls_name":"晾晒指数","ls_hint":"不太适宜","ls_des":"天气阴沉，不利于水分的迅速蒸发，不太适宜晾晒。若需要晾晒，请尽量选择通风的地点。","mf_name":"美发指数","mf_hint":"一般","mf_des":"天热，头皮皮脂分泌会增多，这既会助长发丝间细菌滋生，也会使空气中悬浮物更易黏附在头发上，极易弄脏头发，注意保持头发的清洁。",
		"nl_name":"夜生活指数","nl_hint":"适宜","nl_des":"天气较好，你可以尽情外出享受夜生活的乐趣，不用担心天气会来捣乱。","pj_name":"啤酒指数","pj_hint":"适宜","pj_des":"炎热干燥，一杯清凉的啤酒可有助于缓解燥热之苦，并带来舒爽的感觉。但注意不要贪杯呦！","pk_name":"放风筝指数","pk_hint":"不宜","pk_des":"天气不好，不适宜放风筝。","pl_name":"空气污染扩散条件指数","pl_hint":"较差","pl_des":"气象条件较不利于空气污染物稀释、扩散和清除，请适当减少室外活动时间。","pp_name":"化妆指数","pp_hint":"防脱水","pp_des":"天气较热，易出汗，建议使用防脱水化妆品，少用粉底和胭脂，经常补粉。","sg_name":"一句话提示指数","sg_hint":"暂缺","sg_des":"天气虽然有些阴沉，但时刻保持好心情才最重要哦。","tr_name":"旅游指数","tr_hint":"较适宜","tr_des":"阴天，天气较热，总体来说还是好天气，还是较适宜旅游的，您仍可陶醉于大自然的美丽风光中。",
		"uv_name":"紫外线强度指数","uv_hint":"弱",
		"uv_des":"紫外线强度较弱，建议出门前涂擦SPF在12-15之间、PA+的防晒护肤品。","xc_name":"洗车指数","xc_hint":"较适宜","xc_des":"较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。","xq_name":"心情指数","xq_hint":"较差","xq_des":"天气阴沉，会使人感觉郁闷烦躁，注意室内通风降温，保持神清气和、淡泊宁静的心态。","yd_name":"运动指数","yd_hint":"较适宜","yd_des":"阴天，较适宜开展各种户内外运动。","yh_name":"约会指数","yh_hint":"较不适宜","yh_des":"阴天，天气较热，建议尽量不要去室外约会，如果外出，请您挑选荫凉地点。","ys_name":"雨伞指数","ys_hint":"不带伞","ys_des":"阴天，但降水概率很低，因此您在出门的时候无须带雨伞。","zs_name":"中暑指数","zs_hint":"少发","zs_des":"气温偏高，有可能中暑，体质较弱的朋友请注意防暑降温，避免长时间在日光下暴晒或在高温环境中工作。"}}';
?>